# Asignacion
### Nombre: Guillermo Hernandez
### Cedula: 27.369.180

El dataset asignado fue: World University Rankings 2023 [enlace](https://www.kaggle.com/datasets/alitaqi000/world-university-rankings-2023)

## Importamos las librerias necesarias

In [1]:
import kagglehub
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Descargamos el dataset

In [2]:
# Download latest version
path = kagglehub.dataset_download("alitaqi000/world-university-rankings-2023")

print("Path to dataset files:", path)

Using Colab cache for faster access to the 'world-university-rankings-2023' dataset.
Path to dataset files: /kaggle/input/world-university-rankings-2023

## Cargamos el dataset y revisamos el contenido del dataset

In [3]:
#Estoy usando Google Colab, por eso el direcionamiento utilizado
path = path + '/World University Rankings 2023.csv'
df = pd.read_csv(path)
print(df.info())
display(df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2341 entries, 0 to 2340
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   University Rank              2341 non-null   object
 1   Name of University           2233 non-null   object
 2   Location                     2047 non-null   object
 3   No of student                2209 non-null   object
 4   No of student per staff      2208 non-null   float64
 5   International Student        2209 non-null   object
 6   Female:Male Ratio            2128 non-null   object
 7   OverAll Score                1799 non-null   object
 8   Teaching Score               1799 non-null   float64
 9   Research Score               1799 non-null   float64
 10  Citations Score              1799 non-null   float64
 11  Industry Income Score        1799 non-null   float64
 12  International Outlook Score  1799 non-null   float64
dtypes: float64(6), object(7)
memory usage: 237.9+ KB
None

,University Rank,Name of University,Location,No of student,No of student per staff,International Student,Female:Male Ratio,OverAll Score,Teaching Score,Research Score,Citations Score,Industry Income Score,International Outlook Score
0,1,University of Oxford,United Kingdom,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
1,2,Harvard University,United States,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
2,3,University of Cambridge,United Kingdom,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,3,Stanford University,United States,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
4,5,Massachusetts Institute of Technology,United States,"11,415",8.2,33%,40 : 60,94.2,90.7,93.6,99.8,90.9,89.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2336,-,University of the West of Scotland,NaN,NaN,NaN,NaN,NaN,34.0–39.2,24.1,15.5,61.5,37.9,76.8
2337,-,University of Windsor,NaN,NaN,NaN,NaN,NaN,34.0–39.2,35.1,29.4,34.5,44.2,88.7
2338,-,University of Wolverhampton,NaN,NaN,NaN,NaN,NaN,34.0–39.2,18.2,14.3,68.8,37.3,72.0
2339,-,University of Wuppertal,NaN,NaN,NaN,NaN,NaN,34.0–39.2,26.4,26.7,52.8,52.1,47.6
2340,-,Xi’an Jiaotong-Liverpool University,NaN,NaN,NaN,NaN,NaN,34.0–39.2,17.8,14.8,68.2,38.2,72.4

## Detalles observados y sus soluciones

Se puede observar muchos valores vacios en el dataset, vamos a reemplazarlos por NaN

In [4]:
# Rellenar los valores '' por NaN
for columns in df:
  df[columns] = df[columns].apply(lambda x: np.nan if x=='' else x)

Extra: Para ahorrar trabajo en el analisis y facilitar las decisiones para las transformaciones, revisemos los tipos de datos de cada columa

In [5]:
print(df.dtypes)

University Rank                 object
Name of University              object
Location                        object
No of student                   object
No of student per staff        float64
International Student           object
Female:Male Ratio               object
OverAll Score                   object
Teaching Score                 float64
Research Score                 float64
Citations Score                float64
Industry Income Score          float64
International Outlook Score    float64
dtype: object

Como hay muchos valores vacios, convertidos a NaN, veamos la cantidad de NaN que actualmente hay en el dataset

In [6]:
df.isna().sum()

University Rank                  0
Name of University             108
Location                       294
No of student                  132
No of student per staff        133
International Student          132
Female:Male Ratio              213
OverAll Score                  542
Teaching Score                 542
Research Score                 542
Citations Score                542
Industry Income Score          542
International Outlook Score    542
dtype: int64

Empezamos por las variables categoricas, marcando que el valor es desconocido. Esto se aplica para las variables Name of University y Location

In [7]:
# En estas dos variables, rellenamos los NaN por Unknown
df["Name of University"] = df["Name of University"].fillna("Unknown University")
df["Location"] = df["Location"].fillna("Unknown Location")

Continuamos con las variables de tipo numerico, llenando los Nan con la media de su respectiva columna

In [8]:
# Rellenamos los valores de las variables numericas por la media de su respectiva variable
variables = ["No of student per staff",
"Teaching Score",
"Research Score",
"Citations Score",
"Industry Income Score",
"International Outlook Score"]
for variable in variables:
  df[variable] = df[variable].fillna(df[variable].mean()).round(1)

Observando los valores de la variable No of student tienen el formato con la ',' por lo que procedemos a remover la coma, pasarlo a float y luego llenar los NaN con la media de esta columna

In [9]:
# Paso a paso, sacamos la ',' y rellenamos los NaN por la media
df["No of student"] = df["No of student"].apply(lambda x: x.replace(',', '') if not pd.isna(x) else x)
df["No of student"] = df["No of student"].astype(float)
df["No of student"] = df["No of student"].fillna(df["No of student"].mean()).round(1)

Observando los valores de la variable International Student, podemos observar que es un string con "%" Quitamos el "%" y lo llevamos a fraccion, rellenamos los NaN con la media despues de hacer este proceso

In [10]:
# Paso a paso, sacamos el '%' y rellenamos los NaN por la media
df["International Student"] = df["International Student"].apply(lambda x: x.replace('%', '') if not pd.isna(x) else x)
df['International Student'] = df['International Student'].apply(lambda x: float(x) / 100 if x != '' else np.nan)
df["International Student"] = df["International Student"].fillna(df["International Student"].mean()).round(2)

Observando los valores de la variable Female:Male Ratio, podemos observar que es un string que separa los ratio con ":", rellenamos los NaN con la distribucion de estudiantes mas frecuente, quitamos el ":" y lo separamos en dos columnas diferentes

In [11]:
# Sacamos la distribucion mas comun y rellenamos los NaN con este valor
ratiocomun = df["Female:Male Ratio"].mode()[0] if not df["Female:Male Ratio"].mode().empty else "50 : 50"
df["Female:Male Ratio"] = df["Female:Male Ratio"].fillna(ratiocomun)

In [12]:
# Insertamos en la tabla las nuevas columnas
df.insert(loc=6, column='Female Ratio', value = 0.0)
df.insert(loc=7, column='Male Ratio', value = 0.0)

In [13]:
# Sacamos la distribucion de los estudianes y los colocamos en sus respectivas columnas
for i, observation in df.iterrows():
  if pd.isna(observation["Female:Male Ratio"]):
    continue
  ratio = observation["Female:Male Ratio"].split(" : ")
  df.loc[i,"Female Ratio"] = float(ratio[0])
  df.loc[i,"Male Ratio"] = float(ratio[1])
df = df.drop(columns=['Female:Male Ratio'])

Observando la variable OverAll Score, tenemos valores float, rangos representados en X-Y y valores NaN. Para solucionar esto, reemplazamos los valores NaN con media de los atributos de tipo puntuacion (asumiendo que estos atributos estan relacionados con los valores de la variable OverAll Score). Luego, separamos los rangos en dos columnas nuevas, Overall Score Min y OverAll Score Max, las observaciones que no posean rango tienen el mismo valor en ambos atributos.

In [14]:
# Calculamos el promedio de las otras 5 columnas para cada fila
df['mean_other_scores'] = df[['Teaching Score', 'Research Score', 'Citations Score',
                               'Industry Income Score', 'International Outlook Score']].mean(axis=1).round(1)

# Usamos este promedio para rellenar NaN en OverAll Score
df['OverAll Score'] = df.apply(
    lambda row: row['mean_other_scores'] if pd.isna(row['OverAll Score']) else row['OverAll Score'],
    axis=1
)

# Eliminamos la columna auxiliar para mantener el dataset limpio
df = df.drop('mean_other_scores', axis=1)

In [15]:
# Insertamos en la tabla las nuevas columnas
df.insert(loc=8, column='OverAll Score Min', value = 0.0)
df.insert(loc=9, column='OverAll Score Max', value = 0.0)

In [16]:
# Sacamos el rango de los score y los colocamos en sus respectivas columnas
for i, observation in df.iterrows():
  if pd.isna(observation["OverAll Score"]):
    continue

  score_str = str(observation["OverAll Score"])

  # Verificamos si contiene cualquier tipo de guión, ya que da un error si se usa un "-" normal
  if "-" in score_str or "–" in score_str:
    if "–" in score_str:
        score = score_str.split("–")
    else:
        score = score_str.split("-")
    df.loc[i,"OverAll Score Min"] = float(score[0])
    df.loc[i,"OverAll Score Max"] = float(score[1])
  else:
    value = float(observation["OverAll Score"])
    df.loc[i,"OverAll Score Min"] = value
    df.loc[i,"OverAll Score Max"] = value
df = df.drop(columns=['OverAll Score'])

Revisamos los resultados, verificando que se hayan eliminado la mayor cantidad de NaN posibles

In [17]:
df.isna().sum()

University Rank                0
Name of University             0
Location                       0
No of student                  0
No of student per staff        0
International Student          0
Female Ratio                   0
Male Ratio                     0
OverAll Score Min              0
OverAll Score Max              0
Teaching Score                 0
Research Score                 0
Citations Score                0
Industry Income Score          0
International Outlook Score    0
dtype: int64

Para finalizar, falta procesar las variables categoricas University Rank, Location y Name of University

Observando la variable University Rank, tenemos valores int, valores string como 1501+, rangos como 201-250, Reporter y solo "-". Para solucionar esto, definimos las variables con valor Reporter y "-" como NaN, eliminamos el + de los valores como 1501+, promediamos los rangos y convertimos todo a float.

In [18]:
# Normalizamos el "-", reemplazamos Reporter y solo "-" por NaN, quitamos el "+" de los valores 1501+
# promediamos los rangos y convertimos a float
def processRanking(rank):
    rank = str(rank).replace('–', '-')
    if 'Reporter' in rank or rank == '-':
        return np.nan
    elif '1501+' in rank:
        return 1501.0
    elif '-' in rank:
        rankmin, rankmax = rank.split('-')
        value = (int(rankmin) + int(rankmax)) // 2
        return float(value)
    else:
        return float(rank)

df['University Rank'] = df['University Rank'].apply(processRanking)

Observando la variable Location, tenemos demasiados valores, aplicar un one hot encoding crearia demasiadas columnas nuevas, por lo tanto, reduciremos la cantidad de valores a los 10 valores mas comunes y luego aplicamos one hot encoding

In [19]:
# Definimos los 10 valores mas comunes
topvalue = df['Location'].value_counts().nlargest(10).index.tolist()

# Creamos una columna con estos valores
df['Location_Grouped'] = df['Location'].apply(lambda x: x if x in topvalue else 'Other')

# Generamos una columna con One-Hot Encoding
dummies = pd.get_dummies(df['Location_Grouped'], prefix='Location', dtype=int)

# Unimos las dummies a la tabla original
df = pd.concat([df, dummies], axis=1)

# Eliminamos la variable original y la auxiliar
df = df.drop(columns=['Location', 'Location_Grouped'])

# Verificamos que el resultado haya sido satisfactorio
print(df.columns)

Index(['University Rank', 'Name of University', 'No of student',
       'No of student per staff', 'International Student', 'Female Ratio',
       'Male Ratio', 'OverAll Score Min', 'OverAll Score Max',
       'Teaching Score', 'Research Score', 'Citations Score',
       'Industry Income Score', 'International Outlook Score',
       'Location_Brazil', 'Location_China', 'Location_India', 'Location_Iran',
       'Location_Japan', 'Location_Other', 'Location_Spain', 'Location_Turkey',
       'Location_United Kingdom', 'Location_United States',
       'Location_Unknown Location'],
      dtype='object')

Observando la variable Name of University, tenemos demasiados valores, aplicar un one hot encoding crearia demasiadas columnas nuevas, tambien, podemos asumir que todos los valores en esta variable son unicos, como un ID, por lo que no agrega mucho valor para el analisis de la tabla o para el entrenamiento de algun modelo, por lo que decidimos eliminar esta variable

In [20]:
# Eliminamos la variable Name of University
df = df.drop(columns=['Name of University'])

### Dataset Final

Con todos estos cambios, asi queda la tabla final, con 25 columnas/variables, para una tarea de regresion, se pudiera utilizar la variable University Rank como la variable objetivo.

In [21]:
display(df)

,University Rank,No of student,No of student per staff,International Student,Female Ratio,Male Ratio,OverAll Score Min,OverAll Score Max,Teaching Score,Research Score,...,Location_China,Location_India,Location_Iran,Location_Japan,Location_Other,Location_Spain,Location_Turkey,Location_United Kingdom,Location_United States,Location_Unknown Location
0,1.0,20965.0,10.6,0.42,48.0,52.0,96.4,96.4,92.3,99.7,...,0,0,0,0,0,0,0,1,0,0
1,2.0,21887.0,9.6,0.25,50.0,50.0,95.2,95.2,94.8,99.0,...,0,0,0,0,0,0,0,0,1,0
2,3.0,20185.0,11.3,0.39,47.0,53.0,94.8,94.8,90.9,99.5,...,0,0,0,0,0,0,0,1,0,0
3,3.0,16164.0,7.1,0.24,46.0,54.0,94.8,94.8,94.2,96.7,...,0,0,0,0,0,0,0,0,1,0
4,5.0,11415.0,8.2,0.33,40.0,60.0,94.2,94.2,90.7,93.6,...,0,0,0,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2336,NaN,19617.4,19.0,0.10,58.0,42.0,34.0,39.2,24.1,15.5,...,0,0,0,0,0,0,0,0,0,1
2337,NaN,19617.4,19.0,0.10,58.0,42.0,34.0,39.2,35.1,29.4,...,0,0,0,0,0,0,0,0,0,1
2338,NaN,19617.4,19.0,0.10,58.0,42.0,34.0,39.2,18.2,14.3,...,0,0,0,0,0,0,0,0,0,1
2339,NaN,19617.4,19.0,0.10,58.0,42.0,34.0,39.2,26.4,26.7,...,0,0,0,0,0,0,0,0,0,1
2340,NaN,19617.4,19.0,0.10,58.0,42.0,34.0,39.2,17.8,14.8,...,0,0,0,0,0,0,0,0,0,1